// Учебната година вече е започнала и отговорничката на 10Б клас - Ани трябва да купи определен брой пакетчета с
// химикали, пакетчета с маркери, както и препарат за почистване на дъска. Тя е редовна клиентка на една книжарница, 
// затова има намаление за нея, което представлява някакъв процент от общата сума. Напишете програма, която изчислява
// колко пари ще трябва да събере Ани, за да плати сметката, като имате предвид следния ценоразпис: 
//         •Пакет химикали - 5.80 лв. 
//         •Пакет маркери - 7.20 лв. 
//         •Препарат - 1.20 лв (за литър)
// Вход
// От конзолата се четат 4 числа:
//  -Брой пакети химикали - цяло число в интервала [0...100]
//  -Брой пакети маркери - цяло число в интервала [0...100]
//  -Литри препарат за почистване на дъска - цяло число в интервала [0…50]
//  -Процент намаление - цяло число в интервала [0...100]

// Изход
// Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.

function neededMoney(input){
    let numberPans = Number(input[0]);
    let numberMarkers = Number(input[1]);
    let litersCleaner = Number(input[2]);
    let precentDiscount = Number(input[3])
    let sumWithoutDiscount = numberPans * 5.8 + numberMarkers * 7.2 + litersCleaner * 1.2
    let result = sumWithoutDiscount - (precentDiscount * sumWithoutDiscount/100)
    console.log(result);

}

neededMoney(["2 ",
"3 ",
"4 ",
"25 "]);