// Напишете функция, която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
// На изхода се отпечатва, коя поред е първата комбинацията, чийто сбор от числата е равен на дадено магическо число. 
// Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.

// Вход
// Функцията получава масив от 3 елемента:
//     -Първи – начало на интервала – цяло число в интервала [1...999]
//     -Втори – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
//     -Трети – магическото число – цяло число в интервала [1...10000]

// Изход
// На конзолата трябва да се отпечата един ред, според резултата:
//     -При първата намерена комбинация, чиито сбор на числата е равен на магическото число:
//         o"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
//     -Ако не е намерена комбинация отговаряща на условието:
//         o"{броят на всички комбинации} combinations - neither equals {магическото число}"

function sumOfTwo(input) {
    let firstBoundary = Number(input[0])
    let secondBoundary = Number(input[1])
    let result = Number(input[2])
    let numberLoops = 0
    let itsFind = false
    for (let x = firstBoundary; x <= secondBoundary; x++ ) {
        for (let y = firstBoundary; y <= secondBoundary; y++) {
            numberLoops ++
            if (x + y == result){
                console.log(`Combination N:${numberLoops} (${x} + ${y} = ${result})`);
                itsFind = true
                break;
            }
        
        } if (itsFind) {
            break;
        }
    } if (itsFind != true) {
        console.log(`${numberLoops} combinations - neither equals ${result}`)
    }
}

// sumOfTwo(["88", 
// "888", 
// "2000"])